Repository: sulivan94/PersoBank_UWP_SBortels
Catalog: PersoBank_UWP/Strings/*/Resources.resw
Source language: en_us
Languages: fr_fr

# addCategoryAverageAmount.Text
source: Average amount
fr_fr: Montant moyen

# addCategoryCancelButton.Content
source: Cancel
fr_fr: Annuler

# addCategoryExpenseRadioButton.Content
source: Expense
fr_fr: Dépense

# addCategoryIncomeRadioButton.Content
source: Income
fr_fr: Revenu

# addCategorySaveButton.Content
source: Save
fr_fr: Sauvergarder

# addCategorySuccess
source: The category "{0}" was successfully added !
fr_fr: La catégorie "{0}" a été ajoutée avec succès !

# addCategoryTitle.Text
source: New category
fr_fr: Nouvelle catégorie

# addPlaceAverageAmount.Text
source: Average amount
fr_fr: Montant moyen

# addPlaceCancelButton.Content
source: Cancel
fr_fr: Annuler

# addPlaceCategory.Text
source: Category *
fr_fr: Catégorie *

# addPlaceCity.Text
source: City *
fr_fr: Ville *

# addPlaceName.Text
source: Name *
fr_fr: Nom *

# addPlacePostalCode.Text
source: Postal code
fr_fr: Code postal

# addPlaceSaveButton.Content
source: Save
fr_fr: Sauvegarder

# addPlaceStreet.Text
source: Street
fr_fr: Rue

# addPlaceStreetNumber.Text
source: Number
fr_fr: Numéro

# addPlaceSuccess
source: The place "{0}" was successfully added !
fr_fr: Le lieu "{0}" a été ajouté avec succès !

# addPlaceTitle.Text
source: New place
fr_fr: Nouveau lieu

# apiBadRequest
source: The request sent to the server is invalid !
fr_fr: La requête envoyée au serveur est invalide !

# apiDefaultError
source: Connection error : {0}
fr_fr: Erreur de connexion : {0}

# apiInternalServerError
source: An internal server error has occurred !
fr_fr: Une erreur interne au serveur s'est produite !

# apiNotFound
source: The resource was not found !
fr_fr: La ressource n'a pas été trouvée !

# apiUnauthorized
source: You are not allowed to perform this operation !
fr_fr: Vous n'êtes pas autorisé à effectuer cette opération !

# apiUnavailable
source: The server is temporarily unavailable or under maintenance !
fr_fr: Le serveur est temporairement indisponible ou en maintenance !

# categoriesTitle.Text
source: Categories management
fr_fr: Gestion des catégories

# categoryValidationBeetween1And99999Amount
source: The average amount must be between 1€ and 99999€ !
fr_fr: Le montant moyen doit être compris entre 1€ et 99999€ !

# categoryValidationEmptyLabel
source: Introduce the name of the new category !
fr_fr: Introduisez le nom de la nouvelle catégorie !

# categoryValidationLengthLabel
source: The category name must contain between 4 and 100 caracters !
fr_fr: Le nom de la catégorie doit contenir entre 4 et 100 caractères !

# categoryValidationWrongFormat
source: Wrong category name !
fr_fr: Le nom de la catégorie est incorrect !

# categoryValidationWrongFormatAmount
source: Wrong format for the amount... Only use digits and the comma as unit/decimal separator
fr_fr: Format incorrect pour le montant... N'utilisez que des chiffres et la virgule comme séparateur unité/décimal !

# connection.errorTitle
source: Access denied
fr_fr: Accès refusé

# connectionButton.Content
source: Log in
fr_fr: Se connecter

# connectionLoginLabel.Text
source: Login
fr_fr: Nom d'utilisateur

# connectionPasswordLabel.Text
source: Password
fr_fr: Mot de passe

# connectionTitle.Text
source: Connection
fr_fr: Connexion

# connectionWrongId
source: Wrong login and/or password !
fr_fr: Nom d'utilisateur et/ou mot de passe incorrect(s) !

# deletePlaceSuccess
source: The place "{0}" was successfully deleted !
fr_fr: Le lieu "{0}" a été supprimé avec succès !

# expensesGestionCategory.Content
source: Category
fr_fr: Catégorie

# expensesGestionPlace.Content
source: Place
fr_fr: Lieu

# expensesGestionPourcent.Text
source: with a variation of the average of at least
fr_fr: avec une variation de la moyenne d'au moins

# expensesGestionPourcentageError
source: Please choose a positive percentage !
fr_fr: Choisissez un pourcentage positif !

# expensesGestionSearchButton.Content
source: Research
fr_fr: Rechercher

# homeBestCategory.Text
source: Category most requested :
fr_fr: Catégorie la plus sollicitée :

# homeBestPlace.Text
source: Most frequented place :
fr_fr: Lieu le plus fréquenté :

# homeButtonAverages.Content
source: Average expenses
fr_fr: Dépenses moyennes

# homeButtonCategories.Content
source: Categories management
fr_fr: Gestion des catégories

# homeButtonPlaces.Content
source: Places management
fr_fr: Gestion des lieux

# homeNewInscriptions.Text
source: New registrants :
fr_fr: Nouveaux inscrits :

# homeRecap.Text
source: Summary since :
fr_fr: Récapitulatif depuis :

# homeWelcome.Text
source: Welcome to PersoBank
fr_fr: Bienvenue chez PersoBank

# loginPasswordValidation
source: Please enter your password
fr_fr: Veuillez saisir votre mot de passe

# loginUserNameValidation
source: Please enter your username
fr_fr: Veuillez saisir votre nom d'utilisateur

# modifyCategoryAverageAmount.Text
source: Average amount
fr_fr: Montant moyen

# modifyCategoryCancelButton.Content
source: Cancel
fr_fr: Annuler

# modifyCategoryExpenseRadioButton.Content
source: Expense
fr_fr: Dépense

# modifyCategoryIncomeRadioButton.Content
source: Income
fr_fr: Revenu

# modifyCategoryNbTransactions.Text
source: Number of transactions
fr_fr: Nombre de transactions

# modifyCategorySaveButton.Content
source: Save
fr_fr: Sauvegarder

# modifyCategorySuccess
source: The category "{0}" was updated !
fr_fr: La catégorie "{0}" a été mise à jour !

# modifyCategoryTheoreticalAverage.Text
source: Theoretical average
fr_fr: Moyenne théorique

# modifyCategoryTitle.Text
source: Category modification
fr_fr: Modification d'une catégorie

# modifyCategoryTotalAmount.Text
source: Total amount
fr_fr: Montant total

# modifyPlaceSuccess
source: The place "{0}" was updated !
fr_fr: Le lieu "{0}" a été mis à jour !

# placesTitle.Text
source: Places management
fr_fr: Gestion des lieux

# placeValidationBeetween1000And9999PostalCode
source: The postal code must be between 1000 and 9999 !
fr_fr: Le code postal doit être compris entre 1000 et 9999 !

# placeValidationBeetween1And99999Amount
source: The average amount must be between 1€ and 99999€ !
fr_fr: Le montant moyen doit être compris entre 1€ et 99999€ !

# placeValidationBeetween1And9999Number
source: The street number must be between 1 and 9999 !
fr_fr: Le n° de maison doit être compris entre 1 et 9999 !

# placeValidationEmptyCategory
source: Please choose a category !
fr_fr: Veuillez choisir une catégorie !

# placeValidationEmptyCity
source: Introduce the place's localisation !
fr_fr: Introduisez la localisation du lieu !

# placeValidationEmptyName
source: Introduce the name of the new establishment !
fr_fr: Introduisez le nom du nouvel établissement !

# placeValidationLengthCity
source: The city name must contain between 2 and 100 caracters !
fr_fr: Le nom de la ville doit contenir entre 2 et 100 caractères !

# placeValidationLengthName
source: The name of the establishment must contain between 4 and 100 caracters !
fr_fr: Le nom de l'établissement doit contenir entre 4 et 100 caractères !

# placeValidationLengthStreet
source: The street name must contain between 2 and 100 caracters !
fr_fr: Le nom de rue doit contenir entre 2 et 100 caractères !

# placeValidationWrongFormatAmount
source: Wrong format for the amount... Only use digits and the comma as unit/decimal separator
fr_fr: Format incorrect pour le montant... N'utilisez que des chiffres et la virgule comme séparateur unité/décimal !

# placeValidationWrongFormatCity
source: The city name is wrong !
fr_fr: Le nom de la ville est incorrect !

# placeValidationWrongFormatName
source: The name of the establishment is wrong !
fr_fr: Le nom de l'établissement est incorrect !

# placeValidationWrongFormatNumber
source: Wrong format for the street number... Only use digits !
fr_fr: Format incorrect pour le n° de maison... N'utilisez que des chiffres !

# placeValidationWrongFormatPostalCode
source: Wrong format for the postal code... Only use digits !
fr_fr: Format incorrect pour le code postal... N'utilisez que des chiffres !

# placeValidationWrongFormatStreet
source: Wrong street name !
fr_fr: Le nom de rue est incorrect !

# updatePlaceCurrentAverage.Text
source: Current average
fr_fr: Moyenne actuelle

# updatePlaceNbTransactions.Text
source: Number of transactions
fr_fr: Nombre de transactions

# updatePlaceTheoreticalAverage.Text
source: Theoretical average
fr_fr: Moyenne théorique

# updatePlaceTitle.Text
source: Updating place
fr_fr: Mise à jour du lieu

# updatePlaceTotalAmount.Text
source: Total amount
fr_fr: Montant total

# expensesGestionCategoryError
source: No categories found !
fr_fr: Aucune catégorie n'a été trouvée !

# expensesGestionPlaceError
source: No places found !
fr_fr: Aucun lieu n'a été trouvé !

# requiredFields.Text
source: * Required fields
fr_fr: * Champs obligatoires
